## 데이터 분석
  그래프로 시각화하여 분석 가치 여부 판단

# series
- 1차원 Numpy 기본 객체 타입
- axis labels: 라벨 축 (일반적으로 라벨은 고유값가짐)
- 시계열 포함(시간이 라벨축일 수 있음)
- 라벨축을 가진 1차원 ndarray(시계열 데이터 포함)

In [19]:
import pandas as pd
import numpy as np
s = pd.Series()

<ipython-input-19-4aca996bd49b>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

- pandas.Series(data = None, index = None, dtype= None, name = None, copy= False, fastpath = False)
> - data : 객체 Series에 입력할 데이터(array-like, Iterable, dict, or scalar value)
> - index: 객체 Series Y축으로 설정할 데이터 (array-like, Index(1d))

In [9]:
ss = pd.Series([-4,7, -5, 3], index = ['d','b','a','c'])
print(type(ss))
print(ss.shape)
print(ss.ndim)
print(ss.dtype) #print(ss.dtypes)
print(ss.values)
print(ss.index)

<class 'pandas.core.series.Series'>
(4,)
1
int64
[-4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')

## dict로 구성된 객체 series

In [10]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
ss = pd.Series(sdata)
print(ss)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [13]:
ss = pd.Series([4,7,-5,3])
ss.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
print(ss)
# 없으면(index와 value 길이가 불일치) Error

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [15]:
states = ['California','Ohio','Oregon','Texas']
ss = pd.Series(sdata, index = states)
print(ss)
# 없는 것은 NaN

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
#index로 값찾기 => 권장
print(ss['Ohio'])
print(type(ss['Ohio']))
# series attribute로 값찾기 => 제약이 많음
print(ss.Ohio)
print(type(ss.Ohio))

35000.0
<class 'numpy.float64'>
35000.0
<class 'numpy.float64'>

In [17]:
print(ss[['Ohio','California']])
print(ss[ss<40000])# 조건식은 bool형으로 나타남!
print('Texas' in ss)
print('Utah' in ss)
print('California' in ss)

Ohio          35000.0
California        NaN
dtype: float64
Ohio      35000.0
Oregon    16000.0
dtype: float64
True
False
True

In [20]:
print(ss * 2)
print(np.sqrt(ss))

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
dtype: float64
California           NaN
Ohio          187.082869
Oregon        126.491106
Texas         266.458252
dtype: float64

In [24]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
ss = pd.Series(sdata, index = states)
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
ss2 = pd.Series(sdata)
print(ss+ ss2)
# Utah가 NaN으로 나온다!(숫자가 아닌것과 숫자와의 연산은 NaN값)

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
del(ss2['Utah'])
ss2

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

In [29]:
ss3 = ss2
del(ss3['Oregon'])
ss2
# ss2도 같이 삭제됨! (원본 객체에도 영향을 끼친다)

Ohio     35000
Texas    71000
dtype: int64

In [77]:
ss2.drop('Texas')
ss2
# 원본 Series엔 영향 없음

Ohio     35000
Texas    71000
dtype: int64

# DataFrame
- Two-dimensional
- size-mutable
- potentially heterogeneous: 잠재적으로 이종
- tabular data: 행(Row)/ 열(Column) 형태의 테이블 구조 데이터

In [33]:
df = pd.DataFrame()
print(type(pd.DataFrame(['list'])))
print(type(pd.DataFrame([('tuple')])))
print(type(pd.DataFrame([{"key":"value"}])))
print(type(pd.DataFrame(np.ones((2,3)))))
print(type(pd.DataFrame(pd.DataFrame(["list"]))))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [34]:
df = pd.DataFrame([-4,7,-5,3], index = ['d','b','a','c'])
print(type(df))
print(df.shape)
print(df.ndim)
print(df.dtypes)
print(df.values)
print(df.index)
print(df.columns)

<class 'pandas.core.frame.DataFrame'>
(4, 1)
2
0    int64
dtype: object
[[-4]
 [ 7]
 [-5]
 [ 3]]
Index(['d', 'b', 'a', 'c'], dtype='object')
RangeIndex(start=0, stop=1, step=1)

In [80]:
data = {'state' :['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year': [2000,2001,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
# index는 자동 지정됨 (key, value가 column으로 들어감)
df = pd.DataFrame(data)
df
df.head() # 상위 n개d
df.tail() # 하위 n개

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [81]:
df2 = pd.DataFrame(data, columns = ['year','state','pop','debt'],index = ['one','two','three','four','five','six'])
df2.columns =['year1','state1','pop1','debt1']
df2

       year1  state1  pop1 debt1
one     2000    Ohio   1.5   NaN
two     2001    Ohio   1.7   NaN
three   2002    Ohio   3.6   NaN
four    2001  Nevada   2.4   NaN
five    2002  Nevada   2.9   NaN
six     2003  Nevada   3.2   NaN

In [85]:
df
df['state']
df.state
df[['state','year']]
df2.loc['three'] # y축 기준으로 찾기(행단위로 찾기)
print(type(df['state']))
print(type(df2.loc['three']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [83]:
df2['debt1'] = 16.5
df2

       year1  state1  pop1  debt1
one     2000    Ohio   1.5   16.5
two     2001    Ohio   1.7   16.5
three   2002    Ohio   3.6   16.5
four    2001  Nevada   2.4   16.5
five    2002  Nevada   2.9   16.5
six     2003  Nevada   3.2   16.5

In [45]:
df2['debt1'] = np.arange(6)
df2

       year1  state1  pop1  debt1
one     2000    Ohio   1.5      0
two     2001    Ohio   1.7      1
three   2002    Ohio   3.6      2
four    2001  Nevada   2.4      3
five    2002  Nevada   2.9      4
six     2003  Nevada   3.2      5

In [46]:
df2['debt1'] = np.NaN
df2

       year1  state1  pop1  debt1
one     2000    Ohio   1.5    NaN
two     2001    Ohio   1.7    NaN
three   2002    Ohio   3.6    NaN
four    2001  Nevada   2.4    NaN
five    2002  Nevada   2.9    NaN
six     2003  Nevada   3.2    NaN

## series로 특정 행의 값만 변경

In [51]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two','four','five'])
#index 기준으로 찾아서 변경
df2['debt1'] =val 
df2['debt1'] = pd.Series([-1.2,-1.5,-1.7], index = ['two','four','five'])
df2

       year1  state1  pop1  debt1
one     2000    Ohio   1.5    NaN
two     2001    Ohio   1.7   -1.2
three   2002    Ohio   3.6    NaN
four    2001  Nevada   2.4   -1.5
five    2002  Nevada   2.9   -1.7
six     2003  Nevada   3.2    NaN

## 새로운 열 생성

In [58]:
df2['eastern'] = (df2.state1 == 'Ohio')
# df2['eastern'] = (df2['state1'] == 'Ohio')
df2
# df2.eastern처럼 attribute 같은 형태로는 새로 추가 불가능

       year1  state1  pop1  debt1  eastern
one     2000    Ohio   1.5   16.5     True
two     2001    Ohio   1.7   16.5     True
three   2002    Ohio   3.6   16.5     True
four    2001  Nevada   2.4   16.5    False
five    2002  Nevada   2.9   16.5    False
six     2003  Nevada   3.2   16.5    False

In [64]:
dfnd = pd.DataFrame(np.arange(16).reshape((4,4,)),
                   index= ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])
dfnd

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
dfnd = dfnd.drop(['Colorado','Ohio'])
dfnd

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
dfnd.drop('two',axis = 1)

          one  three  four
Utah        8     10    11
New York   12     14    15

In [70]:
dfnd.drop(['two','four'],axis = 'columns')

          one  three
Utah        8     10
New York   12     14

In [71]:
dfnd.drop('Utah', inplace = True)
dfnd

          one  two  three  four
New York   12   13     14    15

In [73]:
pop = {'Nevada':{2001:2.4, 2002: 2.9}, 'Ohio': {2000:1.5, 2001: 1.7, 2002: 3.6}}
df3 = pd.DataFrame(pop)
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [74]:
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

# indexing/ Slicing
- numpy와 pandas의 indexing/slicing 차이점: index 정보가 정수가 아니어도 됨

In [87]:
ss = pd.Series(np.arange(4.), index = ['a','b','c','d'])
print(ss['b'])
print(ss[1])
print(ss[:2])

print(ss[['b','a','d']])
print(ss[[1,3]])

print(ss[ss < 2])

1.0
1.0
a    0.0
b    1.0
dtype: float64
b    1.0
a    0.0
d    3.0
dtype: float64
b    1.0
d    3.0
dtype: float64
a    0.0
b    1.0
dtype: float64

In [89]:
print(ss['b':'c'])

ss['b':'c'] = 5 # c도 포함
print(ss)

b    5.0
c    5.0
dtype: float64
a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [94]:
df = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio','Colorado','Utah','New York'],
                 columns = ['one','two','three','four'])
df['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [102]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
df[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [97]:
df[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [92]:
df < 5 # booling형으로

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [93]:
df[df['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
df.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [99]:
df.loc[['Colorado','New York'],'one']

Colorado     4
New York    12
Name: one, dtype: int32

In [101]:
df.loc[:'Utah','two'] # Utah까지 출력됨

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [104]:
ser = pd.Series(np.arange(3.))
# print(ser[-1]) # 오류발생 Series는 dict(key, value)이므로 이게 불가능

ser2 = pd.Series(np.arange(3.), index = ['a','b','c'])
print(ser2[-1])

2.0

In [106]:
ser = pd.Series(np.arange(3.))
print(ser.loc[1])
# ser: index 정보 [0,1,2]
ser2 = pd.Series(np.arange(3.), index = [1,2,3])
print(ser2.loc[1])
#ser2 : index 정보 [1,2,3]

1.0
0.0

In [108]:
# iloc은 기본 문법 0번째부터 시작하는 것을 사용
ser = pd.Series(np.arange(3.))
print(ser)
print(ser.iloc[1])
print(ser.iloc[:1])

ser2 = pd.Series(np.arange(3.), index = [1,2,3]) # index를 지정
print(ser2.iloc[1]) 
print(ser2.iloc[:1])# index 지정해서 거기까지 포함
# loc은 마지막 index 정보까지 출력
# iloc은 기본 python 문법에 따라 마지막 정보는 미출력

0    0.0
1    1.0
2    2.0
dtype: float64
1.0
0    0.0
dtype: float64
1.0
1    0.0
dtype: float64

# 산술 연산

In [109]:
s1 = pd.Series([7.3, -2.5, 3.4,1.5], index = ['a','c','d','e'])
s2 = pd.Series([-2.1,3.6,-1.5,4, 3.1], index = ['a','c','e','f','g'])
print(s1 + s2)

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [113]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns = ['b','c','d'],index = ['Ohio','Texas','Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = ['b','d','e'],index = ['Utah','Ohio','Texas','Oregon'])
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [112]:
df1.T + df2.T

   Colorado  Ohio  Oregon  Texas  Utah
b       NaN   3.0     NaN    9.0   NaN
c       NaN   NaN     NaN    NaN   NaN
d       NaN   6.0     NaN   12.0   NaN
e       NaN   NaN     NaN    NaN   NaN

In [114]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns = ['a','b','c','d'])
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = ['a','b','c','d','e'])
df1 + df2 #결측치 발생

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [115]:
df1.add(df2, fill_value = 0)
df2.add(df1, fill_value = 0)
pd.DataFrame.add(df1, df2, fill_value = 0)
pd.DataFrame.add(df2, df1, fill_value = 0)
# fill_value: None or float value (결측치를 다른 값으로 치환하여 연산)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### 반대 계산

- radd
- rsub
- rmul
- rdiv
- rfloordiv
- rpow

In [118]:
1/df1
df1.rdiv(1)
# pd.DataFrame.div(1,df1)
# 1.div(1,df1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

## DataFrame와 series 연산

In [119]:
df = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = ['b','c','d'], index = ['Utah','Ohio','Texas','Oregon'])
ss = df.iloc[0]
df - ss

          b    c    d
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

DataFrame와 Series 연산 시,
객체 DataFrame 열(가로)과 객체 Series 열(세로)가 계산됨
- Numpy Broadcasting
- index 정보의 방향 살피기

In [120]:
ss2 = pd.Series(range(3), index = ['b','e','f'])
df + ss2
# 일치안하는 열은 결측치로 채워짐

          b   c   d   e   f
Utah    0.0 NaN NaN NaN NaN
Ohio    3.0 NaN NaN NaN NaN
Texas   6.0 NaN NaN NaN NaN
Oregon  9.0 NaN NaN NaN NaN

In [126]:
# 열 아닌 행연산 불가!
ss3 = df['d']

df.add(ss3, axis = 'index')

       d  a   b   c
three  0  1   2   3
one    8  9  10  11

In [127]:
df.add(ss3, axis = 0)

       d  a   b   c
three  0  1   2   3
one    8  9  10  11

## index 기준 정렬

In [125]:
# Series: 열기준/ DataFrame: 행기준
ss = pd.Series(range(4), index = ['d','a','b','c'])
df = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'], columns = ['d','a','b','c'])
print(ss.sort_index())
df.sort_index()
df.sort_index(axis = 1)
df.sort_index(axis = 1, ascending= False)

a    1
b    2
c    3
d    0
dtype: int64

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

## 값 기준 정렬

In [128]:
ss = pd.Series([4,np.nan, 7, np.nan, -3, 2])
print(ss.sort_values())

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [130]:
print(ss.sort_values(na_position = 'first'))

# sort_values(axis = 0, ascending = True, na_position = 'last', ignore_index = False..)
# axis 0:index기준(세로) 1: columns 기준 (dataframe)
# ascending True: 오름차순 False: 내림차순
# ignore_index: 기존 index를 무시하고 정수형 index 정보 생성

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [132]:
df = pd.DataFrame([[4,0],[7,1],[-3,0],[2,1]], columns = ['b','a'])
df.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [133]:
df.sort_values(by=['a','b'])[['a','b']]

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [134]:
ss= pd.Series([7,-5,7,4,2,0,4])
print(ss.rank())
print(ss.rank(method='first'))
print(ss.rank(ascending=False, method='max'))
print(ss.rank(method='first').sort_values())
# Series.rank(axis = 0, method='average', na_option='keep', ascending=True)
# na_option: {'keep','top','bottom'}
#  keep: 결측지 NaN은index 정보 위치 그대로 유지
# top: 결측지 NaN은 상단 순위 출력
# bottom: 결측치 NaN은 하단 순위로

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64
0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64
1    1.0
5    2.0
4    3.0
3    4.0
6    5.0
0    6.0
2    7.0
dtype: float64

# 재정렬

In [135]:
ss = pd.Series([4.5,7.2,-5.3,3.6],index =['d','b','a','c'])
ss2 = ss.reindex(['a','b','c','d','e'])
ss2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [137]:
df= pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'], columns = ['Ohio','Texas','California'])
df2 = df.reindex(['a','b','c','d'])
states = ['Texas','Utah','California']
df3 = df.reindex(columns = states)
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [138]:
df2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [139]:
df3

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### reindex